Autodesk.Revit.DB.Electrical.ElectricalEquipment.DistributionSystem
get or set the Distribution System for the Electrical Equipment.
Remarks: This property returns a Distribution System which is assigned to the Electrical Equipment.
If there are no Distribution System assigned to this Electrical Equipment,
this property will be null.

Autodesk.Revit.DB.Electrical.ElectricalEquipment
Provides access to the Electrical Equipment in Autodesk Revit MEP.
Remarks: The Electrical Equipment object can only be queried in Autodesk Revit MEP.